# Integrity Tests

In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

## Domain Integrity Test

In [3]:
%%sql
SELECT *
FROM sqlite_master

 * sqlite:///CourseDataWarehouse.db
Done.

[('table', 'COURSE_MEETINGS', 'COURSE_MEETINGS', 6, 'CREATE TABLE COURSE_MEETINGS(\n    CourseMeetingID INTEGER PRIMARY KEY,\n    CourseOfferingID INTEGER NOT NULL,\n    LocationID INTEGER NOT NULL,\n   ... (74 characters truncated) ... gID TEXT NOT NULL,\n    CourseID INTEGER NOT NULL,\n    ProgramID INTEGER NOT NULL,\n    CourseTitle TEXT NOT NULL,\n    CatalogYear TEXT NOT NULL\n)'),
 ('table', 'CATALOG_COURSES', 'CATALOG_COURSES', 2, 'CREATE TABLE CATALOG_COURSES (\n    CourseID INTEGER PRIMARY KEY,\n    CatalogYear TEXT NOT NULL,\n    CatalogID TEXT NOT NULL,\n    ProgramID INTEGE ... (13 characters truncated) ... eTitle TEXT NOT NULL,\n    Credits TEXT NOT NULL,\n    Prereqs TEXT,\n    Coreqs TEXT,\n    Fees TEXT,\n    Attributes TEXT,\n    Description TEXT\n)'),
 ('table', 'PROGRAMS', 'PROGRAMS', 3, 'CREATE TABLE PROGRAMS (\n    ProgramID INTEGER PRIMARY KEY,\n    ProgramCode TEXT NOT NULL,\n    ProgramName TEXT NOT NULL\n)'),
 ('table', 'LOCATIONS', 'LOCATIONS', 4, 'CREATE TABLE LOCATIONS (\n    LocationID INTEGER PRIMARY KEY,\n    LocationCode TEXT NOT NULL\n)'),
 ('table', 'INSTRUCTORS', 'INSTRUCTORS', 5, 'CREATE TABLE INSTRUCTORS (\n    InstructorID INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL\n)'),
 ('table', 'CATALOG_COURSES_DIM', 'CATALOG_COURSES_DIM', 8, 'CREATE TABLE CATALOG_COURSES_DIM (\n    CourseID INTEGER PRIMARY KEY,\n    CatalogYear TEXT NOT NULL,\n    CatalogID TEXT NOT NULL,\n    ProgramID IN ... (23 characters truncated) ...  TEXT NOT NULL,\n    Credits TEXT NOT NULL,\n    Prereqs TEXT,\n    Coreqs TEXT,\n    Fees TEXT,\n    Attributes TEXT,\n    Description TEXT\n    \n)'),
 ('table', 'PROGRAMS_DIM', 'PROGRAMS_DIM', 9, 'CREATE TABLE PROGRAMS_DIM (\n    ProgramID INTEGER PRIMARY KEY,\n    ProgramCode TEXT NOT NULL,\n    ProgramName TEXT NOT NULL\n)'),
 ('table', 'LOCATIONS_DIM', 'LOCATIONS_DIM', 10, 'CREATE TABLE LOCATIONS_DIM (\n    LocationID INTEGER PRIMARY KEY,\n    LocationCode TEXT NOT NULL\n)'),
 ('table', 'INSTRUCTORS_DIM', 'INSTRUCTORS_DIM', 11, 'CREATE TABLE INSTRUCTORS_DIM (\n    InstructorID INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL\n)'),
 ('table', 'COURSE_MEETING_FACTS', 'COURSE_MEETING_FACTS', 7, 'CREATE TABLE COURSE_MEETING_FACTS(\n    CourseMeetingID INTEGER PRIMARY KEY,\n    CourseOfferingID INTEGER NOT NULL,\n    LocationID INTEGER NOT NULL ... (206 characters truncated) ... rimaryInstructorID INTEGER,\n    Term TEXT NOT NULL,\n    CRN INTEGER NOT NULL,\n    Section TEXT NOT NULL,\n    Credits REAL,\n    Timecodes TEXT\n)')]

## Entity Integrity Tests

* Testing Fact Table to retrieve Professor Coyne's InstructorID

In [9]:
%%sql
SELECT PRIMARYINSTRUCTORID, NAME
FROM COURSE_MEETING_FACTS
    LEFT JOIN INSTRUCTORS_DIM ON PRIMARYINSTRUCTORID = INSTRUCTORID
    LEFT JOIN CATALOG_COURSES_DIM USING (COURSEID)
GROUP BY NAME
HAVING NAME like "%Coyne";

 * sqlite:///CourseDataWarehouse.db
Done.

[(744, 'Michael P.  Coyne')]

In [15]:
%%sql
-- There should be 4440 Catalog Entries, 83 Programs, 207 Locations, and 1095 Instructors
SELECT 
    (SELECT Count(*) FROM CATALOG_COURSES_DIM) as CatalogCourses,
    (SELECT Count(*) FROM PROGRAMS_DIM) as Programs,
    (SELECT Count(*) FROM LOCATIONS_DIM) as Locations,
    (SELECT Count(*) FROM INSTRUCTORS_DIM) as Instructors;

 * sqlite:///CourseDataWarehouse.db
Done.

[(4440, 83, 207, 1095)]

## Relational Integrity Test

* Check How Many Course Meetings for a Given CourseID

In [46]:
%%sql
SELECT COURSE_MEETING_FACTS.CourseID, COURSE_MEETING_FACTS.CourseTitle, Count(COURSE_MEETING_FACTS.COURSEID) AS COURSECOUNT
FROM COURSE_MEETING_FACTS 
    JOIN CATALOG_COURSES_DIM USING (CourseID)
WHERE CourseID = '2333' and Term="Fall2018"

 * sqlite:///CourseDataWarehouse.db
Done.

[(2333, 'Introduction to Financial Accounting', 448)]